[
  {
    "path": "posts/2021-09-07-ttwork/",
    "title": "Tidy Tuesday Work",
    "description": "All of my graphs from weekly Tidy Tuesday work",
    "author": [
      {
        "name": "Anthony Palma",
        "url": {}
      }
    ],
    "date": "2021-09-21",
    "categories": [],
    "contents": "\nBelow are my assignments for the weekly Tidy Tuesday challenge.\nWeek 1: Formula 1 Racing\n\nI am not a big F1 racing fan and was completely unaware of many American drivers being involved. I assumed, as there are many other nationality drivers, that it was more of a European centered sport. I chose to look at American wins over the years as I was curious to see how well American drivers have performed in a sport that I think is not super well known in America. As I suspected, I would guess it is not as well knwon possibly because of the trend seen above. With little American success (actually 0 wins since a bit before 1980), if someone wasn’t an avid fan they most likely would not know much as opposed to more American-centric sports like football.\nWeek 2: Billboard Top Hits\n\nI have heard of many songs going on and off the billboard top hits list. I was curious as to how the speed to the top of the list is different for songs that only were popular for one stint compared to songs that went on and off the list many times, specifically on and off a lot of times. As you can see, songs that are big hits one time only (ie on and off the list, not on and off several times) saw a very quick and steep rise to the top of the list (denoted by a steep slope down w massive y axis scale). As the instance of the song increases, you can see less of a skew on the graph as opposed to the instance == 1 sharp right skew, denoting less of a rise beyond its initial instance. Notice the free y axis scales and how even steeper rises to the top of the list (bottom of y axis) for increased instances does not compare in any way to the massive and exponential rise to the top of the list for instance == 1. In summary, songs that are one hit wonders on the list skyrocket to the top with increased weeks on the chart resulting in higher peak position. Songs that have been on the list already tend to start a bit higher on the list in its initial peak position yet as weeks go on, the rise to the top is wayyyyyy less drastic / evident (or even existent).\nWeek 3: Emmy Awards\n\n\n\n\n\ntuesdata <- tidytuesdayR::tt_load('2021-09-21')\n\n\n\n    Downloading file 1 of 1: `nominees.csv`\n\nnominees <- tuesdata$nominees\n\n\n\n\n\nnominees_new <- \n  nominees %>%\n  select(-logo, -page_id, -page)\n\n\n\n\n\nnominees_new\n\n\n# A tibble: 29,678 × 7\n   category    production   type   title  distributor producer    year\n   <chr>       <chr>        <chr>  <chr>  <chr>       <chr>      <dbl>\n 1 Outstandin… <NA>         Nomin… black… ABC         ABC         2021\n 2 Outstandin… <NA>         Nomin… Bridg… Netflix     A Netflix…  2021\n 3 Outstandin… <NA>         Nomin… Famil… FOX         20th Tele…  2021\n 4 Outstandin… <NA>         Nomin… Archer FX Networks FX Produc…  2021\n 5 Outstandin… Elisabeth W… Nomin… The H… Hulu        Hulu, MGM…  2021\n 6 Outstandin… Martha Spar… Nomin… The H… Hulu        Hulu, MGM…  2021\n 7 Outstandin… Larry Spitt… Nomin… The H… Hulu        Hulu, MGM…  2021\n 8 Outstandin… Rob Hepburn… Nomin… The H… Hulu        Hulu, MGM…  2021\n 9 Outstandin… Lester Cohe… Nomin… The U… HBO         HBO in as…  2021\n10 Outstandin… Doug Huszti… Nomin… The U… HBO         HBO in as…  2021\n# … with 29,668 more rows\n\n\n\nnominees_netflix <- nominees_new %>%\n  filter(distributor == \"Netflix\")\n\n\n\n\n\nNetflix_graph <- nominees_netflix %>%\n    ggplot(aes(x = year)) +\n    geom_histogram(stat = \"count\", fill = \"#Aa1d1d\") +\n    facet_wrap(~type) +\n  labs(x = \"Count\", y = \"Year\", title = \"Netflix's Emmy Award Nominations Compared with Wins Over the Years\", subtitle = \"by Anthony Palma\") \n\n\n\n\n\nNetflix_graph +\n   theme(panel.background = element_rect(fill = \"#000000\"), \n        panel.grid.major = element_blank(), \n        panel.grid.minor = element_blank(), \n        plot.background = element_rect(fill = \"#Aa1d1d\"), \n        text = element_text(color = \"#FFFFFF\"), \n        axis.text = element_text(color = \"#FFFFFF\"))\n\n\n\n\nQuestion: What does Netflix’s Emmy Award performance look like over the years?\nNetflix is my favorite streaming platform which has had dozens of major hits over the last couple years. I was curious as to how their rise in binge-worthy shows over the pandemic would be reflected in a faceted graph looking at nomination and winner of category counts for their shows. To no surprise, their content quality increased as I perceived, which can be seen with the rapid rise in emmy nominated shows, peaking during the 2020 pandemic year (Note: 2021 was still very strong though). Surprisingly, their winner of category graph doesn’t actually peak where their nominations graph does….the winner graph peaks just a bit after in 2021. This could be because some of the backend quality 2020 films/shows were after the 2020 awards or it also could be because Netflix limited production to just their top hits in 2021 maximizing performance of shows and minimzing loss in a tough economic situation…\n\n\n\n",
    "preview": "posts/2021-09-07-ttwork/tt_image.jpeg",
    "last_modified": "2021-10-05T10:17:02-05:00",
    "input_file": {}
  }
]
